bun/wrk_bun.log
Running 10s test @ http://127.0.0.1:3000/?q1=1&q2=2&q3=3&q4=4
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.04ms    1.35ms  35.27ms   74.78%
    Req/Sec     2.07k   154.88     2.33k    71.50%
  246647 requests in 10.01s, 35.99MB read
Requests/sec:  24651.80
Transfer/sec:      3.60MB