bun/wrk_bun.log
Running 10s test @ http://127.0.0.1:3000/?q1=1&q2=2&q3=3&q4=4
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.97ms    1.35ms  37.28ms   75.43%
    Req/Sec     2.08k   166.13     2.33k    68.25%
  247819 requests in 10.01s, 36.16MB read
Requests/sec:  24766.17
Transfer/sec:      3.61MB