bun/wrk_bun.log
Running 30s test @ http://127.0.0.1:3000/?q1=1&q2=2&q3=3&q4=4
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    19.90ms    1.28ms  44.42ms   77.04%
    Req/Sec     1.67k    89.77     2.00k    86.11%
  596969 requests in 30.01s, 87.11MB read
Requests/sec:  19889.81
Transfer/sec:      2.90MB